# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'int128/kubelogin'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
# brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'curl'
brew 'yq'
brew 'openssl'
brew 'kubelogin'
brew 'kubectl@1.26'
brew 'kubectx'
brew 'mtr'
brew 'helm'
brew 'telnet'

# Development
brew 'php'
brew 'php@8.0'
#brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'redis'
brew 'libyaml'

# Apps
cask '1password'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
cask 'powershell'
cask 'ticktick'
cask 'pycharm-ce'
cask 'phpstorm'
cask 'iterm2'
cask 'wireshark'
cask 'dropbox'
cask '1password/tap/1password-cli'
cask 'font-meslo-lg-nerd-font'
cask 'royal-tsx'

# # Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bear', id: 1091189122
