# Tap
tap "azure/kubelogin"
tap "hashicorp/tap"
tap "fluxcd/tap"

# Binaries
brew "zsh"
brew "gcc"
brew "azure/kubelogin/kubelogin"
brew "kubectl"
brew "kubectx"
brew "fzf"  # dependency for "kubectx"
brew "clusterctl"
brew "kind"
brew "helm"
brew "minikube"
brew "ghorg"
brew "yamllint"
brew "azure-cli"
brew "krew"
brew "python3"
brew "hashicorp/tap/terraform"
brew "fluxcd/tap/flux"
brew "podman"
brew "podman-compose"
brew "cosign"
brew "crane"
brew "k9s"
brew "syft"
brew "trivy"
brew "stern"
brew "kubeseal"
brew "kustomize"
brew "direnv"
